# -*- coding:utf-8 -*-
# @Desc : 
# @Author : Administrator
# @Date : 2019-07-02 15:08

# 元组tuple: 元组是不可改变的序列，同list一样，元组可以存放任意类型的元素，一但元组生成，则它不可以改变
# 元组的表示方式: 用小括号()括起来，单个元素括起来用逗号(,)区分是单个对象还是元组

# 创建空元组的字符值: t = ()
# 创建非空元组的字面值
# t = (20,)
# t = (1,2,3)
# t = 100, 200, 300


# 元组的构造函数: tuple()
# tuple():          生成一个空的元组，等同于()
# tuple(iterable):  用可迭代对象生成一个元组
# t = tuple()
# t = tuple(range(10))
# t = tuple([1,2,3,4])


# in / not in : 判断对象是否在容器中,存在返回True,不在返回Flase
# 元组是不可变对象，不支持索引赋值和切片赋值


# 元组的方法:
# T.index(v[,begin[,end]])  用于获取元组中v所在的索引位置
# T.count(v)                用于获取元组中v的个数


